mermiad diagrams
